x = 10

print('x =', x)
print('Hello' if x == 10 else 'Hi')     # тернарный оператор, условие в 1 строку


print()
x = 0 if x == 10 else 5                 # тернарный оператор, условие в 1 строку
print('x =', x)


##############################################################################

d = {
    'sum': lambda x,y: x + y,
    'sub': lambda x,y: x - y
}

print('Sum = ', d['sum'](1, 2))
print('Sub = ', d['sub'](1, 2))

##############################################################################

def test(x, y, z):
    print(x, y, z)

l = [1, 2, 3]
d = {'x': 1, 'y': 2, 'z': 3}

test(*l)    # распаковка списка     (*args)
test(**d)   # распаковка словаря    (**kwargs)